DataProcessors/ВыгрузкаДляАБЦПВэксельPostЗапрос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаДляАБЦПВэксельPostЗапрос</Name>
			<Comment>Выгрузка для ABCP Excel в Post запрос</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКфайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолОст</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаДляОптовика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество, переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ВыгрузкаДляАБЦПВэксельPostЗапрос/Ext/ObjectModule.bsl
Процедура ЗаполнитьТаблицуТоваровОтправитьПостЗапрос() Экспорт
	
	Перем МассивДанныхJSON;
	
	МассивДанныхJSON = Новый Массив;

	ИмяФ = Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+Формат(ТекущаяДата(),"ДЛФ=T");
	ИмяФ = СтрЗаменить(ИмяФ,"-","");
	ИмяФ = СтрЗаменить(ИмяФ,":","");
	ИмяФ = СтрЗаменить(ИмяФ," ","");
	ЭтотОбъект.ПутьКфайлу = КаталогВременныхФайлов()+ИмяФ+".xlsx";	
	
	КраткоеИмяФайла = ИмяФ+".xlsx";	
	
	ЭтотОбъект.ТипЦен=Справочники.ТипыЦен.ОптоваяЦена;
	ЭтотОбъект.ПодразделениеКомпании=Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Ссылка КАК Номенклатура,
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК КолОст,
	|	ЦеныСрезПоследних.Цена КАК ЦенаДляОптовика,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Производитель.Наименование КАК Производитель,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
	|	(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток) * ЦеныСрезПоследних.Цена КАК Сумма
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки КАК ОстаткиТоваровКомпанииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|			ЦеныСрезПоследних.Цена КАК Цена
	|		ИЗ
	|			РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	|		ГДЕ
	|			ЦеныСрезПоследних.ТипЦен = &ТипЦен
	|			И ЦеныСрезПоследних.ПодразделениеКомпании = &ПодразделениеКомпании) КАК ЦеныСрезПоследних
	|		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул,
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток,
	|	(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток) * ЦеныСрезПоследних.Цена,
	|	ЦеныСрезПоследних.Цена,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Ссылка,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Производитель.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сумма УБЫВ";
	
	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦен.ОптоваяЦена);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
 	
  	Состав.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ФайлВыгрузки = Новый Файл(ПутьКФайлу);
	
	 ёё = 0;
	 
	 Макет = ПолучитьМакет("Макет");
	 ТабДок = Новый ТабличныйДокумент;
	 
	 ОбластьЗаг = Макет.ПолучитьОбласть("ЗагТаб");
	 ОбластьЗаг.Параметры.ЗаголовокОтчета = "Прайс-лист от "+Формат(ТекущаяДата(),"ДЛФ=DD");
	 ТабДок.Вывести(ОбластьЗаг);
	 
	 ОбластьШапки = Макет.ПолучитьОбласть("ШапкаТаб");
	 ТабДок.Вывести(ОбластьШапки);

	 ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаТаб");
	 
	 Всего = Состав.Количество();
	 
	 Для каждого Стр1 Из Состав Цикл
		 
		 ОбработкаПрерыванияПользователя();
		
		#Если Клиент Тогда
		Состояние("Строка: "+СокрЛП(Стр1.НомерСтроки)+" из "+Всего); 
	 	#КонецЕсли
	 	
		Если обЗначениеНеЗаполнено(Стр1.ЦенаДляОптовика) ИЛИ (Число(СокрЛП(СтрЗаменить(Стр1.ЦенаДляОптовика,Символы.НПП,""))) < 0)  Тогда
		    Продолжить;
	 	КонецЕсли; 
		
		Если обЗначениеНеЗаполнено(Стр1.КолОст) ИЛИ (Число(СокрЛП(СтрЗаменить(Стр1.КолОст,Символы.НПП,""))) < 0)  Тогда
		    Продолжить;
		КонецЕсли; 
		
		ёё = ёё + 1;
		
		ОбластьСтроки.Параметры.Нпп = ёё;
		ОбластьСтроки.Параметры.Товар = СокрЛП(Стр1.Производитель);
		ОбластьСтроки.Параметры.Производитель = СокрЛП(Стр1.Производитель);
 		ОбластьСтроки.Параметры.Артикул = СокрЛП(Стр1.Артикул);
		ОбластьСтроки.Параметры.КолОст = Число(СокрЛП(СтрЗаменить(Стр1.КолОст,Символы.НПП,"")));
		ОбластьСтроки.Параметры.ЦенаОпт = Число(СокрЛП(СтрЗаменить(Стр1.ЦенаДляОптовика,Символы.НПП,"")));
		ОбластьСтроки.Параметры.ДЦ = "Авто Лига";
 		ОбластьСтроки.Параметры.СрокПоставкиВднях = "2-3";
		ТабДок.Вывести(ОбластьСтроки);
 	 	
	КонецЦикла; 
	
	ОбластьПодвала = Макет.ПолучитьОбласть("ПодвалТаб");
	ОбластьПодвала.Параметры.ОбОтчете = "Прайс-лист сформирован "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь;
	ТабДок.Вывести(ОбластьПодвала);

	
  	ТипФ = ТипФайлаТабличногоДокумента.XLSX;
	
	ФайлСформирован=Истина;
	
	ПолноеИмяФайла = ПутьКфайлу;
	
	Попытка
		ТабДок.Записать(ПолноеИмяФайла,ТипФ);
	Исключение
		ФайлСформирован=Ложь;
	КонецПопытки;
	 
    //=============================================================================
	
	Если ФайлСформирован Тогда
		
		URL    = "id23632.public.api.abcp.ru";
		Логин  = "api@id23632";
 		Пароль = "4ccaad1b07bb89c470bb9afde1001bf2";
		
	 	Попытка
			HTTPСоединение = Новый HTTPСоединение(URL,443,Логин,Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(),Истина);
			//HTTPСоединение = Новый HTTPСоединение(URL, 80, ,,,,,);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА! Не удалось подключиться к серверу: "+URL);		
			Отказ = Истина;
			Возврат;
		КонецПопытки; 
		
		Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
 		запросPOST = Новый HTTPЗапрос("/cp/distributor/pricelistUpdate"); 
		запросPOST.АдресРесурса="/cp/distributor/pricelistUpdate";
 		
 		СодержимоеФайла = ПолучитьСтрокуИзДвоичныхДанных(Новый ДвоичныеДанные(ПолноеИмяФайла));
 		
		запросPOST.Заголовки.Вставить("Content-type", СтрЗаменить("multipart/form-data; Boundary="+Boundary,"""",""));  
 		
		КодироватьФайл = Истина; 
		
		ИмяФайлаОтправки = КаталогВременныхФайлов() + "post.txt"; 
		
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI, Символы.ПС, Ложь); 
		
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary); 
		ФайлОтправки.ЗаписатьСтроку("Content-Disposition: form-data; name=""userlogin"""+ Символы.ПС); 
		ФайлОтправки.ЗаписатьСтроку("api@id23632"); 
		
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary); 
		ФайлОтправки.ЗаписатьСтроку("Content-Disposition: form-data; name=""userpsw"""+ Символы.ПС); 
		ФайлОтправки.ЗаписатьСтроку("4ccaad1b07bb89c470bb9afde1001bf2"); 
		
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary); 
		ФайлОтправки.ЗаписатьСтроку("Content-Disposition: form-data; name=""distributorId"""+ Символы.ПС); 
		ФайлОтправки.ЗаписатьСтроку("1548436"); 
  		
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary); 
 		ФайлОтправки.ЗаписатьСтроку("Content-Disposition: form-data; name=""uploadFile""; filename=""" + КраткоеИмяФайла + """"); 
 		ФайлОтправки.ЗаписатьСтроку("Content-Type: application/octet-stream" + Символы.ПС); 
		
		ФайлОтправки.ЗаписатьСтроку(СодержимоеФайла); 
		ФайлОтправки.ЗаписатьСтроку("--" + Boundary);
			
 		ФайлОтправки.Закрыть();
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаОтправки);
	 	запросPOST.Заголовки.Вставить("Content-Length",Строка(Формат(ДвоичныеДанные.Размер(),"ЧЦ=10; ЧГ=0")));
		
	    запросPOST.Заголовки.Вставить("FileTypeId",1);
  		
		ЗапросPost.УстановитьИмяФайлаТела(ИмяФайлаОтправки);
 		
		ФайлОтвета = КаталогВременныхФайлов()+ "АnswerFromABCP.html";
		
		БезОшибок = Истина;
		
		Попытка
			Рез = HTTPСоединение.ВызватьHTTPМетод("POST", запросPOST, ФайлОтвета);
 		Исключение
			БезОшибок = Ложь;
		КонецПопытки; 
	Иначе
		#Если Клиент Тогда
			Сообщить("ОШИБКА! Файл XLSX не сформирован.",СтатусСообщения.ОченьВажное); 
		#КонецЕсли
	КонецЕсли; 
	
	Если БезОшибок Тогда
		#Если Клиент Тогда
			Сообщить("Запрос прошел успешно",СтатусСообщения.Внимание); 
			ЗапуститьПриложение("explorer " + ФайлОтвета);
		#КонецЕсли
   	Иначе
		#Если Клиент Тогда
			Сообщить("ОШИБКА! Запрос не выполнен",СтатусСообщения.ОченьВажное); 
		#КонецЕсли
	КонецЕсли; 
 
КонецПроцедуры
